# Operações

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Informações sobre valores únicos

In [2]:
df['col2'].unique()

array([444, 555, 666])

In [3]:
df['col2'].nunique()

3

In [4]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecionando dados

In [5]:
df[(df['col1']>2)]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [6]:
# Seleciona dados do DataFrame ustilizando critÃ©rios baseados em mÃºltiplas colunas
newdf = df[(df['col1']>1) & (df['col2']>444)]

In [7]:
newdf

   col1  col2 col3
1     2   555  def
2     3   666  ghi

### Utilizando funções

In [8]:
def quadrado(x):
    return x**2

In [9]:
df['col1'].apply(quadrado)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [10]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [11]:
df['col2'].apply(lambda x: x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [12]:
df['col1'].sum()

10

** Removendo uma coluna**

In [13]:
del df['col1']

In [14]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Obtendo colunas e nomes dos índices **

In [15]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [16]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Ordenando um DataFrame:**

In [17]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [18]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Buscando e verificando valores vazios **

In [19]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [20]:
# Elimina linha com NaNs
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Preenchendo os NaNs com valores **

In [21]:
import numpy as np

In [22]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [23]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

** Reestruturando **

In [24]:
data = {'A':['casa','casa','casa','apartamento','apartamento','apartamento'],
     'B':['centro','centro','subúrbio','centro','centro','centro'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [25]:
df

             A         B  C  D
0         casa    centro  x  1
1         casa    centro  y  3
2         casa  subúrbio  x  2
3  apartamento    centro  y  5
4  apartamento    centro  x  4
5  apartamento    centro  y  1

In [26]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C                       x    y
A           B
apartamento centro    4.0  3.0
casa        centro    1.0  3.0
            subúrbio  2.0  NaN